Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/housing_taxes_and_reliefs/paying_local_property_tax.html.txt.tmx
Source language: en
Languages: ga

source: Paying the Local Property Tax (LPT)
ga: An Cháin Mhaoine Áitiúil (CMÁ) a Íoc

source: • Paying the LPT in 2017
ga: • An CMÁ a íoc in 2017

source: Revenue offer a range of methods for paying your Local Property Tax (LPT)
ga: Cuireann na Coimisinéirí Ioncaim réimse modhanna ar fáil chun do Cháin Mhaoine Áitiúil (CMÁ) a íoc

source: You can opt to make one single payment or you can pay the tax in equal instalments over the year
ga: Féadfaidh tú a roghnú chun íocaíocht singil amháin a dhéanamh nó féadfaidh tú an cháin a íoc i dtráthchodanna cothroma i gcaitheamh na bliana

source: See ‘Payment methods’ below
ga: Féach ‘Modhanna íocaíochta’ thíos

source: Your LPT is based on the valuation of your property on 1 May 2013
ga: Bunaítear do CMÁ ar luacháil do mhaoine amhail an 1 Bealtaine 2013

source: The rate you pay may vary in 2017 because of the local adjustment factor
ga: D’fhéadfadh an ráta a íocann tú in 2017 bheith éagsúil tar éis gur tugadh isteach an fachtóir coigeartaithe áitiúil

source: This means that the basic LPT rates can be adjusted up or down by up to 15% in different local authority areas
ga: Ciallaíonn seo gur féidir na rátaí bunúsacha CMÁ a choigeartú aníos nó anuas a mhéid le 15% i limistéir éagsúla údaráis áitiúil

source: In 2016, a number of local authorities have adjusted LPT rates in their area for 2017
ga: I 2016, laghdaigh líon údarás áitiúla rátaí CMÁ ina limistéar don bhliain 2017

source: These adjustments will be applied automatically by Revenue
ga: Cuirfidh na Coimisinéirí Ioncaim an laghdú seo i bhfeidhm go huathoibríoch

source: You can check how much LPT you owe for 2017 by accessing your LPT record online using your PPS number, Property ID and PIN. You can also use Revenue's online calculator to check how much LPT is payable in different local authority areas
ga: Féadfaidh tú a sheiceáil cé mhéid CMÁ atá le híoc agat don bhliain 2017 trí do thaifead CMÁ ar líne a rochtain trí d’Uimhir PSP, Aitheantas Maoine agus d’Uimhir Aitheantais Phearsanta a úsáid

source: You can also access Local Property Tax online through Revenue's myAccount and through ROS. MyAccount consolidates access to all of Revenue’s secure online services (except ROS) using a single log-in and password. It is open to everyone who is not registered for ROS. The existing LPT portal will continue to remain open
ga: Anuas air sin, féadfaidh tú áireamhán ar líne na gCoimisinéirí Ioncaim a úsáid lena sheiceáil cé mhéid CMÁ atá iníoctha i limistéir éagsúla údaráis áitiúil

source: Paying the LPT in 2017
ga: An CMÁ a íoc in 2017

source: If you were the liable person for the property on 1 November 2016 (generally the person who owns the property) you have to pay LPT for 2017
ga: Más tú féin an duine faoi dhliteanas íoc as an maoin an 1 Samhain 2016 (an duine ar leis/léi an mhaoin go ginearálta) tá ort an CMÁ a íoc don bhliain 2017

source: You do not need to revalue your property for 2017 since the valuation that applied on 1 May 2013 continues to be valid
ga: Ní gá duit do mhaoin a athluacháil don bhliain 2017 mar gheall go bhfuil an luacháil a cuireadh i bhfeidhm an 1 Bealtaine 2013 bailí go dtí an 31 Deireadh Fómhair 2019

source: If you sell your property after 1 November 2016 you are liable for the 2017 LPT on the property
ga: Má dhíolann tú do mhaoin i ndiaidh an 1 Samhain 2016, tá tú faoi dhliteanas íoc as CMÁ 2017 ar an maoin

source: If you claimed a full deferral of your LPT liability and your circumstances have not changed you do not need to do anything
ga: Má d’éiligh tú iarchur iomlán do dhliteanais CMÁ in 2015 agus murar athraigh do chúinsí, ní gá duit aon rud a dhéanamh

source: If you think you may qualify for a full or partial deferral of LPT in 2017 you can claim a deferral through the LPT online system
ga: Má mheasann tú go bhféadfá cáiliú d’iarchur iomlán nó páirteach den CMÁ in 2017, féadfaidh tú iarchur a éileamh tríd an gcóras CMÁ ar líne

source: If you are eligible for a partial deferral you still need to tell Revenue what payment method you want to use to pay the remainder of your LPT liability (see 'Payment methods' below)
ga: Má tá tú i dteideal iarchur páirteach a fháil, tá ort na Coimisinéirí Ioncaim a chur ar an eolas ar cén modh íocaíochta is mian leat a úsáid chun fuílleach do dhliteanais CMÁ a íoc (féach ‘Modhanna íocaíochta’ thíos)

source: People who paid 2016 LPT in instalments
ga: Daoine a d’íoc CMÁ 2016 i dtráthchodanna

source: If you paid your 2016 LPT in instalments or in phased payments (for example, by deduction at source or direct debit) this payment method automatically applies for 2017 and subsequent years
ga: Má d’íoc tú do CMÁ 2016 i dtráthchodanna nó in íocaíochtaí céimnithe (mar shampla, trí asbhaint ag an bhfoinse nó trí dhochar díreach), bainfidh an modh íocaíochta seo go huathoibríoch le haghaidh 2017 agus blianta dá éis sin

source: Revenue did not contact you unless your local authority adjusted the rate for 2017
ga: Ní dhéanfaidh na Coimisinéirí Ioncaim teagmháil leat

source: If your LPT rate changed for 2017 you did not need to do anything
ga: Má d’athraigh do ráta CMÁ le haghaidh 2017, ní gá duit aon rud a dhéanamh

source: Revenue automatically adjusted your payment
ga: Déanfaidh na Coimisinéirí Ioncaim d’íocaíocht a choigeartú go huathoibríoch

source: You do not need to contact Revenue unless you wish to select a different payment method for 2017
ga: Ní gá duit teagmháil a dhéanamh leis a Coimisinéirí Ioncaim mura mian leat modh difriúil íocaíochta a roghnú do 2017

source: See 'Changing your payment method' below
ga: Féach ‘Do mhodh íocaíochta a athrú’ thíos

source: People who paid 2016 LPT in a lump sum or cash
ga: Daoine a d’íoc CMÁ 2016 i gcnapshuim nó in airgead tirim

source: If you paid your LPT in 2016 in one lump sum (for example, by single debit authority, debit or credit card, cheque, postal order or cash) or made regular payments in cash you needed to confirm your payment method for 2017
ga: Má d’íoc tú do CMÁ in 2016 i gcnapshuim amháin (mar shampla, trí údarú dochair singil, cárta dochair nó creidmheasa, seic, ordú poist nó airgead tirim) nó má rinne tú íocaíochtaí rialta in airgead tirim, is gá duit do mhodh íocaíochta do 2017 a dheimhniú

source: You should have got a letter from Revenue (or an email if you are a ROS customer) confirming the amount of LPT due for 2017 and telling you whether your local authority changed the rate for 2017
ga: Gheobhaidh tú litir ó na Coimisinéirí Ioncaim (nó ríomhphost más custaiméir ROS thú) ina ndeimhneofar an méid den CMÁ atá le híoc do 2017 agus a inseoidh duit cibé acu ar athraigh nó nár athraigh d’údarás áitiúil an ráta don bhliain 2017

source: If you own more than one property the letter will confirm the total amount due for all your properties
ga: Má tá úinéireacht agat ar bhreis agus maoin amháin, deimhneoidh an litir an méid iomlán atá le híoc ar do mhaoin go léir

source: The letter included your Property ID and PIN
ga: Beidh Aitheantas do Mhaoine agus Uimhir Phearsanta Aitheantais do Mhaoine san áireamh sa litir

source: When you got this letter you should have confirmed how you want to pay your 2017 LPT to Revenue - by 25 November 2016 if you wanted to use a phased payment method or by 11 January 2017 if you wanted to pay in full in one lump sum
ga: Ní mór duit seo a dhéanamh faoin 25 Samhain 2016 más mian aistriú chuig modh céimnithe íocaíochta nó faoin 11 Eanáir 2017 más mian leat íocaíocht iomlán a dhéanamh in aon chnapshuim amháin

source: You could choose to continue to pay your LPT in the way you paid it in 2016 or you can change your payment method
ga: Féadfaidh tú a roghnú chun do CMÁ a íoc ar an mbealach a d’íoc tú í in 2016 nó féadfaidh tú do mhodh íocaíochta a athrú

source: Changing your payment method
ga: Do mhodh íocaíochta a athrú

source: You can change (or confirm) your payment method using the LPT online system
ga: Féadfaidh tú do mhodh íocaíochta a athrú (nó a dheimhniú) tríd an gcóras CMÁ ar líne a úsáid

source: If you need help with changing your payment method online you can call the LPT helpline on 1890 200 255
ga: Má theastaíonn cúnamh uait le do mhodh íocaíochta a athrú ar líne, is féidir leat glao ar an líne chabhrach CMÁ ar 1890 200 255

source: You could choose any of these payment methods for 2017 even if you previously paid in a different way
ga: Féadfaidh tú aon cheann de na modhanna íocaíochta seo le haghaidh 2017 a roghnú, fiú má d’íoc tú ar bhealach éagsúil roimhe seo

source: You could pay your LPT for 2017 in full by:
ga: Féadfaidh tú do CMÁ le haghaidh 2017 a íoc ina iomláine, trí:

source: • Debit/credit card: This option is available online
ga: • Cárta dochair/creidmheasa: Tá an rogha seo ar fáil ar líne

source: Note that if you pay by debit/credit card the deduction will be made immediately
ga: Tabhair faoi deara, má íocann tú trí chárta sochair/dochair, déanfar an asbhaint láithreach

source: • Bank single debit authority: Under a single debit authority you can authorise your bank or financial institution to pay Revenue the specified amount of LPT due
ga: • Údarú dochair singil bhainc: Faoi údarú dochair shingil bhainc, féadfaidh tú do bhanc nó institiúid airgeadais a údarú chun an méid sonraithe den CMÁ atá le híoc a íoc leis na Coimisinéirí Ioncaim

source: This amount is taken from your bank account in one deduction on 21 March 2017 and is paid directly to Revenue
ga: Bainfear an méid seo de do chuntas bainc in aon asbhaint amháin an 21 Márta 2017 agus íocfar é go díreach leis na Coimisinéirí Ioncaim

source: • Cash or debit/credit card payments through certain payment service providers (you can check the list on revenue.ie)
ga: • Airgead nó íocaíochtaí cárta dochair/sochair trí sholáthróirí áirithe seirbhís íocaíochta (féadfaidh tú an liosta a sheiceáil ar revenue.ie)

source: A transaction charge usually applies
ga: Is gnách go ngearrtar muirear idirbhirt

source: • Cheque or postal order: People who pay online cannot pay by cheque or postal order
ga: • Seic nó ordú poist: Daoine a íocann ar líne mar gheall nach féidir leo íoc le seic nó ordú poist

source: On page 1 of the LPT1A Payment Instruction form (“Option 2 – Payment in Full”) insert an x in the relevant box to confirm that you are paying by cheque or postal order
ga: Ar leathanach 1 d’fhoirm Threoir Íocaíochta LPT1A (“Rogha 2 – Íocaíocht ina Iomláine”), cuir ‘x’ isteach sa bhosca cuí lena dheimhniú go mbeidh íocaíocht á déanamh agat trí sheic nó ordú poist

source: Make your cheque or postal order payable to the Collector-General and record your Property ID on the back of it
ga: Déan do sheic nó ordú poist iníoctha leis an Ard-Bhailitheoir agus scríobh Aitheantas do Mhaoine ar a chúl

source: Do not 'post-date' your cheque or postal order
ga: Ní déan do sheic nó ordú poist a ‘iardhátú’

source: Send the cheque or postal order and your LPT1A Payment Instruction form to Revenue LPT Branch, PO Box 1, Limerick by 11 January 2017
ga: Seol an seic nó an t-ordú poist agus d’fhoirm Threoir Íocaíochta LPT1A chuig Brainse CMÁ na gCoimisinéirí Ioncaim, Bosca Poist 1, Luimneach faoin 11 Eanáir 2017

source: Cheques and postal orders will be processed as soon as Revenue receives them
ga: Próiseálfar seiceanna agus orduithe poist a luaithe a fhaigheann na Coimisinéirí Ioncaim iad

source: Find out more about paying by cheque or postal order
ga: Níos mó eolais a fháil faoi íocaíocht a dhéanamh le seic nó ordú poist

source: You could pay your LPT for 2017 in instalments (phased payments) by:
ga: Féadfaidh tú do CMÁ don bhliain 2017 a íoc i dtráthchodanna (íocaíochtaí céimnithe) sna modhanna a leanas:

source: • Direct debit - you can pay monthly by direct debit
ga: • Dochar díreach – féadfaidh tú íoc trí dhochar díreach míosúil

source: • Deduction at source from salary or occupational pension
ga: • Asbhaint ag an bhfoinse ó thuarastal nó pinsean ceirde

source: You need your employer or pension provider’s name and tax registration number
ga: Teastaíonn ainm agus cláruimhir do sholáthróra pinsin nó d’fhostóra uait

source: This number is on your P60 and may be on your payslip
ga: Tá an uimhir seo ar do P60 agus d’fhéadfadh sí bheith le sonrú ar do dhuillín pá

source: • Deduction at source from certain social welfare payments*
ga: • Asbhaint ag an bhfoinse ó íocaíochtaí áirithe leasa shóisialaigh*

source: • Deduction at source from certain scheme payments made to farmers by the Department of Agriculture, Food and the Marine (DAFM)
ga: • Asbhaint ag an bhfoinse ó íocaíochtaí áirithe scéime a dhéanann an Roinn Talmhaíochta, Bia agus Mara (DAFM) le feirmeoirí*

source: *The payments are State Pension (Contributory, Non-Contributory or Transition), Widow/Widower's or Surviving Civil Partner's Contributory or Non-Contributory Pension, One-Parent Family Payment, Invalidity Pension, Carer's Allowance, Disability Allowance and Blind Pension
ga: *Is iad na híocaíochtaí Pinsean Stáit (Ranníocach, Neamh-Ranníocach nó Aistriú), Pinsean Ranníocach nó Neamh-Ranníocach Páirtnéara Shibhialta Mharthanaigh nó Baintrí/Baintreach Fir, Íocaíocht Teaghlach Aontuismitheora, Pinsean Easláinte, Liúntas Cúramóra, Liúntas Míchumais agus Pinsean na nDall

source: You should note that the Department of Social Protection will not make deductions that will bring a payment below the personal rate of basic Supplementary Welfare Allowance
ga: Ba cheart duit a thabhairt faoi deara nach ndéanfaidh an Roinn Coimirce Sóisialaí asbhaintí a laghdóidh íocaíocht faoi bhun an ráta phearsanta den bhunráta den Liúntas Leasa Forlíontach

source: Note that if you chose to pay in instalments from your salary, pension, social welfare or scheme payments your LPT payments are deducted in equal instalments
ga: Tabhair faoi deara, má roghnaíonn tú chun íoc i dtráthchodanna ó do thuarastal, pinsean, íocaíochtaí leasa shóisialaigh nó scéime, asbhainfear d’íocaíochtaí CMÁ i dtráthchodanna cothroma

source: This means that the amount of each instalment will depend on how frequently you are paid
ga: Ciallaíonn seo go mbraithfidh méid gach tráthchoda ar cé chomh minic a íoctar thú

source: For example, people getting monthly salary payments will have their LPT payment deducted monthly
ga: Mar shampla, asbhainfear a n-íocaíocht CMÁ gach mí ó dhaoine a fhaigheann íocaíochtaí míosúla tuarastail

source: Social welfare pensions are paid weekly so a weekly LPT deduction will be made
ga: Íoctar pinsin leasa shóisialaigh gach seachtain, mar sin, déanfar asbhaint CMÁ seachtainiúil

source: Options for paying your LPT in a single payment
ga: Roghanna chun do CMÁ a íoc in íocaíocht singil

source: You should have told Revenue by 11 January 2017 if you wanted to use or change to one of these methods
ga: Ní mór duit na Coimisinéirí Ioncaim a chur ar an eolas faoin 11 Eanáir 2017 más mian leat ceann amháin de na modhanna seo a úsáid nó a athrú

source: │Lump sum payment methods │Latest date for payment │More details │
ga: │Modhanna íocaíochta cnapshuime │An dáta is déanaí íocaíochta │Breis Sonraí │

source: │Debit card or credit card │11 January 2017 │If you pay by debit or credit card the deduction will be made the day the transaction is completed online
ga: │Cárta dochair no creidmheasa │An 11 Eanáir 2017 │Má íocann tú trí chárta dochair nó creidmheasa, déanfar an asbhaint ar an lá a chríochnófar an t-idirbheart ar líne

source: │Single cash payment through a service provider │11 January 2017 │Cash or debit/credit card payments through certain payment service providers (you can check the list on revenue.ie)
ga: │Íocaíocht airgid singil trí sholáthróir seirbhíse │An 11 Eanáir 2017 │Airgead nó íocaíochtaí cárta dochair/sochair trí sholáthróirí áirithe seirbhís íocaíochta (féadfaidh tú an liosta a sheiceáil ar revenue.ie)

source: │Single Debit Authority │You must inform Revenue by 11 January 2017 that you are using this method
ga: │Údarú Singil Dochair │Ní mór duit na Coimisinéirí Ioncaim a chur an eolas faoin 11 Eanáir 2017 go bhfuil leas á bhaint agat as an modh seo

source: Payment is deducted on 21 March 2017
ga: Asbhainfear an íocaíocht an 21 Márta 2017

source: │This amount is taken from your bank account in one deduction on 21 March 2017 and is paid directly to Revenue
ga: │Bainfear an méid seo de do chuntas bainc in aon asbhaint amháin an 21 Márta 2015 agus íocfar é go díreach leis na Coimisinéirí Ioncaim

source: You can specify an earlier date if you wish
ga: Féadfaidh tú dáta níos luaithe a shonrú más mian leat

source: │Cheque or postal order │11 January 2017 │Make the cheque or postal order payable to the Collector General and record your Property ID on the back of the cheque or postal order
ga: │Seic nó ordú poist │An 11 Eanáir 2017 │Déan do sheic nó ordú poist iníoctha leis an Ard-Bhailitheoir agus scríobh Aitheantas do Mhaoine ar chúl an tseic nó an ordaithe poist

source: Options for paying your LPT in instalments
ga: Roghanna chun do CMÁ a íoc i dtráthchodanna

source: You should have told Revenue by 25 November 2016 if you wanted to use or change to one of these methods
ga: Ní mór duit na Coimisinéirí Ioncaim a chur ar an eolas faoin 25 Samhain 2017 más mian leat ceann amháin de na modhanna seo a úsáid nó a athrú

source: │Phased payment methods │Date payment starts │More details │
ga: │Modhanna íocaíochta céimnithe │An dáta a thosófar an íocaíocht │Breis sonraí │

source: │Monthly direct debit │15 January 2017 │Payment is deducted from your current account on the 15th of each month from 15 January until 15 December 2017
ga: │Dochar díreach míosúil │An 15 Eanáir 2017 │Asbhaintear íocaíocht ó do chuntas reatha an 15ú lá gach mí ón 15 Eanáir go dtí an 15 Nollaig 2017

source: │Deduction at source from salary or occupational pension │First payday in 2017 │The LPT payments are spread evenly over 2017
ga: │Asbhaint ag an bhfoinse ó thuarastal nó ó phinsean gairme │An chéad lá pá in 2017 │Leatar na híocaíochtaí CMÁ go cothrom i gcaitheamh na bliana 2017

source: │Deduction at source from certain social welfare payments made by DSP │First DSP payment in 2017 │Deductions from DSP payments are spread evenly over 2017
ga: │Asbhaint ag an bhfoinse ó íocaíochtaí áirithe leasa shóisialaigh a dhéanann an RCS │An chéad íocaíocht den RCS in 2017 │Leatar asbhaintí ó íocaíochtaí na RCS go cothrom i gcaitheamh na bliana 2017

source: │Deduction at source from certain scheme payments made to farmers by the Department of Agriculture, Food and the Marine (DAFM) │First DAFM payment in 2017 │LPT is deducted from DAFM payments in 2017
ga: │Asbhaint ag an bhfoinse ó roinnt íocaíochtaí scéime a dhéanann an Roinn Talmhaíochta, Bia agus Mara (DAFM) le feirmeoirí │An chéad íocaíocht den DAFM in 2017│Asbhaintear an CMÁ ó íocaíochtaí an DAFM in 2017

source: │Cash or debit/credit card payments through the 4 payment service providers │January 2017 │You can make payments weekly or monthly in 2017
ga: │Íocaíochtaí airgid thirim nó cárta dochair/creidmheasa trí na 4 sholáthróir seirbhís íocaíochta │Eanáir 2017 │Féadfaidh tú íocaíochtaí a dhéanamh gach seachtain nó gach mí in 2017

source: You must tell Revenue how often you want to make payments when you confirm your payment method
ga: Ní mór duit na Coimisinéirí Ioncaim a chur ar an eolas cé chomh minic is mian leat íocaíochtaí a dhéanamh nuair a dheimhníonn tú do mhodh íocaíochta

source: Remember that if you qualify for a partial deferral of your LPT payment in 2017 you must select the partial deferral option (online or on the paper LPT1A payment instruction, if you receive a paper form from Revenue) and select a payment option for the remaining 50% of your LPT liability
ga: Cuimhnigh, má cháilíonn tú d’iarchur páirteach d’íocaíochta CMÁ in 2017, ní mór duit an rogha ‘iarchur páirteach’ a roghnú (ar líne nó ar threoir íocaíochta LPT1A ar pháipéar, má fhaigheann tú foirm ar pháipéar ó na Coimisinéirí Ioncaim) agus rogha íocaíochta a roghnú don 50% eile de do dhliteanas CMÁ

source: I don’t have my Property ID or PIN
ga: Níl Aitheantas nó Uimhir Aitheantais Phearsanta mo Mhaoine agam

source: If you do not have your Property ID or PIN you can log in to the LPT online system, provide your PPS number or Tax Reference number and submit a request for your Property ID/PIN
ga: Mura bhfuil Aitheantas nó Uimhir Aitheantais Phearsanta do Mhaoine agat, féadfaidh tú logáil isteach sa chóras CMÁ ar líne, d’Uimhir PSP nó d’Uimhir Thagartha Cánach a sholáthar agus iarratas a sheoladh isteach ar Aitheantas nó Uimhir Aitheantais Phearsanta do Mhaoine

source: These details will be sent by post within 5 working days to the address on Revenue's record for the PPS number or Tax Reference number supplied by you
ga: Seolfar na sonraí seo sa phost laistigh de 5 lá oibre chuig an seoladh ar thaifead na gCoimisinéirí Ioncaim don uimhir PSP nó don Uimhir Thagartha Cánach a sholáthair tú

source: Alternatively, you can call the LPT helpline on 1890 200 255 to get your Property ID or PIN
ga: Mar rogha air sin, féadfaidh tú glao ar an líne chabhrach CMÁ ar 1890 200 255 chun Aitheantas nó Uimhir Aitheantais Phearsanta do Mhaoine a fháil

source: If you are a ROS customer who is a designated owner of a property(s) and you have a business digital certificate for authentication purposes, you receive notification about your LPT obligations via your ROS inbox and via the email account associated with your ROS account
ga: Más custaiméir ROS thú atá mar úinéir ainmnithe ar mhaoin agus má tá deimhniú digiteach gnó agat ar mhaithe le cuspóirí fíordheimhnithe, faigheann tú fógra faoi do dhualgais CMÁ trí do bhosca isteach ROS agus tríd an gcuntas ríomhphoist a bhaineann le do chuntas ROS

source: You can access your residential property details and your LPT Return directly from your "My Services" page in ROS, without having to input a Property ID or PIN
ga: Féadfaidh tú do shonraí a rochtain faoi do mhaoin chónaithe agus do Thuairisceán CMÁ go díreach ón leathanach “Mo Sheirbhísí” in ROS, gan bheith ort Aitheantas nó Uimhir Aitheantais Phearsanta Mhaoine a iontráil

source: If you have not filed a LPT Return or paid your LPT for 2013 and/or 2014 and/or 2015 and/or 2016 and/or 2017 you should pay and file as soon as possible
ga: Murar chomhdaigh tú Tuairisceán CMÁ nó murar íoc tú do CMÁ don bhliain 2013 agus/nó 2014, agus/nó 2015, agus/nó 2016, agus/nó 2017 ba cheart duit íoc agus tuairisciú a luaithe is féidir

source: If you do not pay the outstanding amounts Revenue will contact you and will inform you of the way in which they propose to recover the debt
ga: Mura n-íocann tú na suimeanna nár íocadh go fóill, déanfaidh na Coimisinéirí Ioncaim teagmháil leat agus thú a chur ar an eolas ar an mbealach a bheartaíonn siad chun an fiachas a aisghabháil

source: Revenue will also recover arrears of the Household Charge (which is now collected through the LPT system)
ga: Anuas air sin, gheobhaidh na Coimisinéirí Ioncaim riaráistí den Mhuirear Teaghlaigh (a bhailítear anois tríd an gcóras CMÁ) ar ais

source: • Mandatory deduction from your salary, wages or occupational pension
ga: • Asbhaint éigeantach ó do thuarastal, pá nó ó phinsean ceirde

source: • Attachment of your bank account (this means taking money without your consent using an attachment order)
ga: • Astú do chuntais bhainc (ciallaíonn seo airgead a ghlacadh gan toiliú a fháil uait trí ordú astaithe a úsáid)

source: • Referral of the debt to a sheriff or a solicitor for collection
ga: • An fiachas a atreorú chuig sirriam nó aturnae lena bhailiú

source: • The withholding of refunds of other tax as payment against LPT due
ga: • Cistí cánach eile a choinneáil siar mar íocaíocht i leith an CMÁ atá dlite
